---
kind: type
id: T:Autodesk.Revit.Exceptions.AutoJoinFailedException
source: html/666f8a45-18c9-0a1f-1a3f-eaa0ac96f23f.htm
---
# Autodesk.Revit.Exceptions.AutoJoinFailedException

The exception that is thrown when an autojoin operation failed.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class AutoJoinFailedException : InvalidOperationException
```